{
    "format": "graph-model",
    "generatedBy": "2.14.0",
    "convertedBy": "TensorFlow.js Converter v4.12.0",
    "signature": {
        "inputs": {
            "dense_input": {
                "name": "dense_input:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "4"
                        }
                    ]
                }
            }
        },
        "outputs": {
            "dense_7": {
                "name": "Identity:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "1"
                        }
                    ]
                }
            }
        }
    },
    "modelTopology": {
        "node": [
            {
                "name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "4"
                                    },
                                    {
                                        "size": "4"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "4"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "4"
                                    },
                                    {
                                        "size": "512"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "512"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "512"
                                    },
                                    {
                                        "size": "512"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "512"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_3/MatMul/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "512"
                                    },
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_3/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_4/MatMul/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    },
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_4/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_5/MatMul/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    },
                                    {
                                        "size": "64"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_5/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "64"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_6/MatMul/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "64"
                                    },
                                    {
                                        "size": "32"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_6/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "32"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_7/MatMul/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "32"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_7/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "dense_input",
                "op": "Placeholder",
                "attr": {
                    "shape": {
                        "shape": {
                            "dim": [
                                {
                                    "size": "-1"
                                },
                                {
                                    "size": "4"
                                }
                            ]
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense/Relu",
                "op": "_FusedMatMul",
                "input": [
                    "dense_input",
                    "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
                    "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "transpose_a": {
                        "b": false
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA==",
                                "UmVsdQ=="
                            ]
                        }
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_1/Relu",
                "op": "_FusedMatMul",
                "input": [
                    "StatefulPartitionedCall/sequential/dense/Relu",
                    "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
                    "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "transpose_a": {
                        "b": false
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA==",
                                "UmVsdQ=="
                            ]
                        }
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_2/Relu",
                "op": "_FusedMatMul",
                "input": [
                    "StatefulPartitionedCall/sequential/dense_1/Relu",
                    "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp",
                    "StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "transpose_a": {
                        "b": false
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA==",
                                "UmVsdQ=="
                            ]
                        }
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_3/Relu",
                "op": "_FusedMatMul",
                "input": [
                    "StatefulPartitionedCall/sequential/dense_2/Relu",
                    "StatefulPartitionedCall/sequential/dense_3/MatMul/ReadVariableOp",
                    "StatefulPartitionedCall/sequential/dense_3/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "transpose_a": {
                        "b": false
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA==",
                                "UmVsdQ=="
                            ]
                        }
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_4/Relu",
                "op": "_FusedMatMul",
                "input": [
                    "StatefulPartitionedCall/sequential/dense_3/Relu",
                    "StatefulPartitionedCall/sequential/dense_4/MatMul/ReadVariableOp",
                    "StatefulPartitionedCall/sequential/dense_4/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "transpose_a": {
                        "b": false
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA==",
                                "UmVsdQ=="
                            ]
                        }
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_5/Relu",
                "op": "_FusedMatMul",
                "input": [
                    "StatefulPartitionedCall/sequential/dense_4/Relu",
                    "StatefulPartitionedCall/sequential/dense_5/MatMul/ReadVariableOp",
                    "StatefulPartitionedCall/sequential/dense_5/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "transpose_a": {
                        "b": false
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA==",
                                "UmVsdQ=="
                            ]
                        }
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_6/Relu",
                "op": "_FusedMatMul",
                "input": [
                    "StatefulPartitionedCall/sequential/dense_5/Relu",
                    "StatefulPartitionedCall/sequential/dense_6/MatMul/ReadVariableOp",
                    "StatefulPartitionedCall/sequential/dense_6/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "transpose_a": {
                        "b": false
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA==",
                                "UmVsdQ=="
                            ]
                        }
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_7/Relu",
                "op": "_FusedMatMul",
                "input": [
                    "StatefulPartitionedCall/sequential/dense_6/Relu",
                    "StatefulPartitionedCall/sequential/dense_7/MatMul/ReadVariableOp",
                    "StatefulPartitionedCall/sequential/dense_7/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "transpose_a": {
                        "b": false
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA==",
                                "UmVsdQ=="
                            ]
                        }
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "Identity",
                "op": "Identity",
                "input": [
                    "StatefulPartitionedCall/sequential/dense_7/Relu"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            }
        ],
        "library": {},
        "versions": {
            "producer": 1575
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
                    "shape": [
                        4,
                        4
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp",
                    "shape": [
                        4
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
                    "shape": [
                        4,
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp",
                    "shape": [
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp",
                    "shape": [
                        512,
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp",
                    "shape": [
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_3/MatMul/ReadVariableOp",
                    "shape": [
                        512,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_3/BiasAdd/ReadVariableOp",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_4/MatMul/ReadVariableOp",
                    "shape": [
                        256,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_4/BiasAdd/ReadVariableOp",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_5/MatMul/ReadVariableOp",
                    "shape": [
                        128,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_5/BiasAdd/ReadVariableOp",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_6/MatMul/ReadVariableOp",
                    "shape": [
                        64,
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_6/BiasAdd/ReadVariableOp",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_7/MatMul/ReadVariableOp",
                    "shape": [
                        32,
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_7/BiasAdd/ReadVariableOp",
                    "shape": [
                        1
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}